In [2]:
import pandas as pd
df = pd.DataFrame({'key' : ['A','A','A','B','C','C'],
                  'data' : [0,5,3,2,54,5]})
df

  key  data
0   A     0
1   A     5
2   A     3
3   B     2
4   C    54
5   C     5

In [7]:
for key in ['A', 'B', 'C']:
    print(key,df[df['key']==key].sum())

A key     AAA
data      8
dtype: object
B key     B
data    2
dtype: object
C key     CC
data    59
dtype: object

#### groupby原理 :  split --- apply --- combine

In [16]:
df.groupby('key').mean()

          data
key
A     2.666667
B     2.000000
C    29.500000

In [17]:
df.groupby('key').sum()

     data
key
A       8
B       2
C      59

In [19]:
df = pd.read_csv('./titanic/train.csv')

In [27]:
df.groupby('Sex')['Age'].sum()

Sex
female     7286.00
male      13919.17
Name: Age, dtype: float64